app/Models/ModelLokasi.php

INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('Kos Bapak Safari', 'Desa Blater rt04/rw02', '-7.427045710181885', '109.34244866564443', '1702309293_91b3486ca7b05eba2e30.jpeg')
---
    public function insertData($data)
    {
        $this->db->table('tbl_lokasi')->insert($data);

SELECT *
FROM `tbl_lokasi`
---
    public function getAllData()
    {
        return  $this->db->table('tbl_lokasi')
            ->get()->getResultArray();

SELECT *
FROM `tbl_lokasi`
WHERE `id_lokasi` = '2'
---
    public function getDataById($id_lokasi)
    {
        return  $this->db->table('tbl_lokasi')
        ->where('id_lokasi',$id_lokasi)
        ->get()->getRowArray();